<?php


namespace App\classes;


class blog
{
    private $blogs;

    public function __construct()
    {
        $this->blogs = [
            0 => [
                'id' => 1,
                'title' => 'রোবটিকসে কাকতাড়ুয়ার জয় থেরাপি',
                'description' => 'দলের নাম কাকতাড়ুয়া। নাম শুনে বোঝার উপায় নেই, রোবটিকস নিয়ে তাঁদের কারবার। বাংলাদেশ ইউনিভার্সিটি অব বিজনেস অ্যান্ড টেকনোলজির (বিইউবিটি) তড়িৎ ও ইলেকট্রনিকস প্রকৌশল বিভাগের একদল শিক্ষার্থী মিলে এই দল গড়েছেন। ভিন্ন ভিন্ন কার্যক্ষমতাসম্পন্ন রোবট তৈরি করেন তাঁরা। অংশ নেন প্রযুক্তিসংশ্লিষ্ট বিভিন্ন প্রতিযোগিতায়। গত আগস্টে আহ্‌ছানউল্লা বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ে বসেছিল ‘অস্ট রোভার চ্যালেঞ্জ ২০২২’–এর আসর। তাতে ‘হার্ডওয়্যার শোকেসিং’ বিভাগে অংশ নিয়ে প্রথম হয়েছে কাকতাড়ুয়া। তাদের প্রকল্পটির মূল উদ্দেশ্য ছিল কৃষিকাজের আধুনিকায়ন। প্রকল্পটির জন্য অ্যাগ্রোবট, অ্যাগ্রোড্রোন এবং স্মার্ট কাকতাড়ুয়া নামের তিনটি আলাদা কাজ করতে সক্ষম রোবট তৈরি করতে হয়েছে। কম লোকবল ব্যবহার করে কম সময়ে উৎপাদন বাড়ানোই ছিল এসব রোবট তৈরির উদ্দেশ্য। কাকতাড়ুয়ার রোবটগুলো দর্শনর্থী ও বিচারকদের প্রশংসা পেয়েছে। সেপ্টেম্বরে রাজশাহী বিশ্ববিদ্যালয়ের সায়েন্স ক্লাব এবং জাতীয় বিজ্ঞান জাদুঘরের সহযোগিতায় আয়োজিত হয় ‘৬ষ্ঠ জাতীয় বিজ্ঞান মেলা’। বিইউবিটির শিক্ষার্থীদের দুটি দল আলাদা প্রকল্প নিয়ে তাতে অংশ নেন। বিইউবিটির দুটি দল, ‘কাকতাড়ুয়া’ এবং ‘ক্লিন রোবো’ আয়োজনের ‘প্রজেক্ট শো’ বিভাগে যথাক্রমে প্রথম ও দ্বিতীয় স্থান অর্জন করে।',
                'img' => 'blog-1.jpg',


            ],
            1 => [
                'id' => 2,
                'title' => 'কেন অকুপেশনাল থেরাপি নিয়ে পড়বেন',
                'description' => 'মানুষের সেবা করার ব্রত নিয়ে যাঁরা স্বাস্থ্যসেবামূলক খাতে যুক্ত হতে চান, তাঁদের জন্য ‘অকুপেশনাল থেরাপি’ হতে পারে একটি বড় সুযোগ। এই শিক্ষা নিয়ে একদিকে আপনি যেমন স্বাবলম্বী হতে পারেন, তেমনি প্রতিবন্ধীদের সমাজের মূল স্রোতের সঙ্গে যুক্ত করে কিংবা বয়স্ক ব্যক্তিদের পুনর্বাসিত করে সমাজে গুরুত্বপূর্ণ ভূমিকা রাখতে পারেন। সমৃদ্ধ ইতিহাস স্বাধীনতাযুদ্ধের পর ১৯৭২ সালে বাংলাদেশে প্রথম ব্যাপক হারে অকুপেশনাল থেরাপিস্টের প্রয়োজন পড়ে। যুদ্ধাহত মুক্তিযোদ্ধা ও যুদ্ধে ক্ষতিগ্রস্ত ব্যক্তিদের পুনর্বাসনের জন্য এই পেশাজীবীদের প্রয়োজনটা টের পাওয়া যায়। আর জে গাস্ট নামের এক ভিনদেশি অর্থোপেডিক সার্জনের তত্ত্বাবধানে সে সময় জাতীয় অর্থোপেডিক হাসপাতাল ও পুনর্বাসন প্রতিষ্ঠানে (নিটোর, পঙ্গু হাসপাতাল নামেই বেশি পরিচিত) চালু হয় অকুপেশনাল থেরাপি কোর্স। ১৯৭৬ সালে প্রথম ব্যাচ বের হওয়ার পর কোর্সটি অনির্দিষ্টকালের জন্য বন্ধ হয়ে যায়। সম্ভবত প্রয়োজনীয় সম্পদ ও লোকবলের অভাবে কোর্সটি চালু রাখা যায়নি। পরে ১৯৯৫ সালে সাভারে পক্ষাঘাতগ্রস্তদের পুনর্বাসন কেন্দ্রে (সিআরপি) আবার চালু হয় অকুপেশনাল থেরাপি কোর্স।',
                'img' => 'blog-2.jpg',


            ],
            2 => [
                'id' => 3,
                'title' => 'মিষ্টিকুমড়ার বাগানে কে বসে আছে, জানো?',
                'description' => '১৬৫০ সালে পৃথিবীর জনসংখ্যা ছিল ৫০ কোটি। এর ২০০ বছর পর পৃথিবীর জনসংখ্যা ১০০ কোটিতে পৌঁছায়। এরপর পৃথিবীর জনসংখ্যা দ্বিগুণ হতে সময় লাগে ৮০ বছর। জনসংখ্যা ২০০ কোটি থেকে ৪০০ কোটিতে পৌঁছাতে সময় লাগে মাত্র ৪৫ বছর। জাতিসংঘের হিসাব অনুযায়ী, এ বছরের শেষের দিকে পৃথিবীর জনসংখ্যা ৮০০ কোটিতে পৌঁছাবে। অর্থাৎ ১৯৭৫ সালের পর ৪৭ বছরে পৃথিবীর জনসংখ্যা দ্বিগুণ হবে। জনসংখ্যা বৃদ্ধির এই অস্বাভাবিক প্রবণতার ফলে পৃথিবী ধীরে ধীরে বসবাসের অনুপযোগী হয়ে উঠছে, দেশে দেশে দেখা দিচ্ছে খাদ্যসংকট।',
                'img' => 'blog-3.jpg',


            ],

        ];
    }


    public function allBlogs()
    {
        return $this->blogs;
    }
}